[{"IDVRM": "VACASA", "ID": "VACASA2287", "Name": "Sugar Shack - Sugarloaf, CA", "Website": "https://www.vacasa.com/unit.php?UnitID=2287", "Description": "Elegant ski/lake home w/ relaxing deck & spacious kitchen!\nEscape to the gorgeous San Bernardino Mountains for your ski or lake vacation at this three-bedroom\nBig Bear Lake vacation rental\n. With room for up to seven guests, WiFi access, and a beautiful deck with seating and a grill, everyone will thoroughly enjoy this getaway.\nLocated in a quiet neighborhood, this cabin is 18 minutes to Bear Mountain for downhill skiing, snowboarding, and cross-country skiing, and 16 minutes to Big Bear Lake for wake-boarding, water skiing, tubing, and jet skiing.\nIt may look like a typical mountain home from the outside, but the inside boasts warm olive green walls, wood floors, fantastic tile-work in the bathrooms, and a wood fireplace surrounded by ivory stone.\nThe large living room will quickly become a hot spot in the house with its comfortable leather sofas, large flatscreen TV with cable and DVD player, a mini bar with two stools, and the cozy wood fireplace. End your adventurous day on the snowy mountains cuddled up by the fire with a good movie and a glass of wine or hot chocolate.\nWith a kitchen this spacious and well-stocked, everyone can join in on the meal-making. This gourmet kitchen has a refrigerator, double ovens, a gas stove-top, dishwasher, microwave, toaster, and plenty of cookware. Enjoy meals together at this stunning wood table with six leather-upholstered chairs.\nAlthough the main floor does include a crimson half-bathroom, all three bedrooms are on the third floor. The master suite has a plush king bed, a flatscreen TV, a private balcony where you can be peaceful encircled about in nature, and an elegant bathroom with a stand-alone shower.\nA second bedroom includes a queen bed and the third bedroom has a twin over full bunk bed, pack-n-play (a high chair and baby gates also included), and two leather recliner chairs. Incredible masonry tile-work covers the upstairs full bathroom with a jetted bathtub and shower.\nWhen the weather is nice, head out to the covered deck for barbecuing on the grill while relaxing on one of the padded chairs.\nWith so much to do year-round at Big Bear, you'll need to experience both summer and winter months here. The snow brings epic downhill skiing, snowboarding and more at Bear Mountain and warmth brings boating, fishing, jet skis, and more at Big Bear Lake. Rentals are readily available for any activity any season and Magic Mountain brings even more fun with an alpine slide, mini-golf, and a water slide in the summer and tubing in the winter.\nHead to The Village for dinner at Bistro at the Mansion for steaks and seafood or beers at Big Bear Lake Brewing Company. Don't miss out on great shopping at The Village as well and take the whole crew to Big Bear Funplex for arcade games, laser tag, and an indoor skating rink.\nSnow or shine, this lovely\nSouthern California vacation rental\nwill make the perfect home base for your next mountain getaway.", "Address": "204 Vista Avenue, Sugarloaf, CA  92386", "Location": " Sugarloaf", "Bedrooms": 0, "Occupancy": 0, "Tier": "BRONZE", "Status": "INACTIVE", "Last scrape": 